Tekla Open API Reference for Tekla Structures 2025
Rectangle Constructor (ViewBase, Point, Point, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with two points using the given attributes. Please note that creating a rectangle using two points will re-calculate the start point to correspond with positive widths and heights.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Rectangle(
	ViewBase view,
	Point startPoint,
	Point endPoint,
	Rectangle.RectangleAttributes attributes
)
Public Sub New (
	view As ViewBase,
	startPoint As Point,
	endPoint As Point,
	attributes As Rectangle.RectangleAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
attributes
Type: Tekla.Structures.Drawing.Rectangle.RectangleAttributes
The rectangle attributes to be used.
See Also
Reference
Rectangle Class
Rectangle Overload
Tekla.Structures.Drawing Namespace